BenchBnB/app/models/user.rb

    def generate_session_token
        self.session_token = SecureRandom.urlsafe_base64(16)
        while User.find_by(session_token: self.session_token)
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "QYmnD9w7D7--MRVIDNk5zw"], ["LIMIT", 1]]